# Словник зі словами для перекладу (українська → японська)
dictionary = {
    'привіт': 'こんにちは',  # konnichiwa
    'кіт': '猫',  # neko
    'собака': '犬',  # inu
    'книга': '本',  # hon
    'вода': '水',  # mizu
    'хліб': 'パン',  # pan
    'сонце': '太陽',  # taiyō
    'дерево': '木',  # ki
    'молоко': '牛乳',  # gyūnyū
    'друг': '友達'  # tomodachi
}

while True:
    word = input(
        "Введіть слово для перекладу та тільки існуючі слова! (або 'вихід' для завершення, 'додати' для додавання нового слова): ").lower()

    if word == 'вихід':
        break

    elif word == 'додати':
        new_word = input("Автору було лінь додавати інші слова, якщо так треба, напиши слово яке хочеш перекласти: ").lower()
        translation = input(f"введи його переклад на японській сюди '{new_word}' на японську: ").lower()
        dictionary[new_word] = translation
        print(f"Слово '{new_word}' з перекладом '{translation}' я додав до словника,дякую тобі,незнайомець")

    elif word in dictionary:
        print("Переклад японською:", dictionary[word])
    else:
        print("що самий розумний?нема такого слова")






