print("Привіт, це невеличкий тест по аніме магічна битва.Він перевірить наскільки ти добре знаєш сюжет.Бажаю вдачі")
# Список питань і правильних відповідей
questions =[("Як звати головного героя?", "юдзі ітадорі"),
    ("Як називається школа, де навчаються екзорцисти?", "токійська школа магії"),
    ("Хто є королем проклять?", "сукуна"),
    ("Як звати вчителя Юдзі?", "сатору годзьо"),
    ("Скільки пальців Сукуни потрібно, щоб повернути його повну силу?", "20")]

score = 0  # Лічильник балів

# Цикл по питаннях
for question, correct_answer in questions:
    answer = input(question + " ").strip().lower()
    if answer == correct_answer:
        print("Правильно!")
        score += 1
    else:
        print(f"Неправильно! Правильна відповідь: {correct_answer}")

# Вивід фінального результату з оцінкою
print(f"\nГра закінчена! Твій результат: {score} з {len(questions)} балів.")

if score == 0:
    print("Ти що, взагалі не дивився?! Ану швидко пішов дивитися! Чекаю знову!")
elif score <= 2:
    print("Не так уже і погано, але передивися ще раз!")
elif score <= 4:
    print("Молодець, добре знаєш сюжет!")
else:
    print("Ну взагалі фанат, люблю тебе ❤️")
